posts/yong-nikola-zai-github-shang-xie-bo-ke.org
#+BEGIN_COMMENT
.. title: 用 Nikola 在 GitHub 上写博客
.. slug: yong-nikola-zai-github-shang-xie-bo-ke
.. date: 2016-10-21 22:36:11 UTC+08:00
.. tags: mathjax
.. link: 
.. description: 
.. type: text 
#+END_COMMENT

#+TITLE:     用 Nikola 写博客
#+AUTHOR:    赵骥
#+EMAIL:     zhaoji-001@163.com.cn
#+DATE:      2016-10-21
#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  zh_CN
#+EXPORT_SELECT_TAGS: export
#+OPTIONS: num:t toc:nil
#+EXPORT_EXCLUDE_TAGS: noexport
#+LATEX_CLASS: ctexart
-----------------

使用 Jekyll, Hexo 等框架在 GitHub Pages 上搭建静态个人博客越来越流行。

而我选用 Nikola 框架的原因是他原生支持 org-mode 文件的解析。此外，它是用 python 写成的，对于我这种不会 Ruby 的人，更为有亲和力。

#+BEGIN_HTML
<!-- TEASER_END --> 
#+END_HTML


* 安装 Nikola
   安装 Nikola 非常简单 =pip install Nikola[extras]=
* 新建一个 GitHub pages
新建一个空的 GitHub Repository, 并 clone 到你的电脑上

#+BEGIN_SRC bash
$ git clone git@github.com:<username>.github.io.git ~/blog 
#+END_SRC

这个库将包含两个分支：master 渲染好的网页， sources 原始文件。所以我们要新建一个分支 sources

#+BEGIN_SRC bash
$ cd ~/blog
$ git checkout -b sources 
#+END_SRC

新建一个 .gitignore 文件
#+BEGIN_EXAMPLE
*.py[cod]
__pycache__
cache
output
.doit.db
_env/
#+END_EXAMPLE

commit 到 source 分支

#+BEGIN_SRC bash
$ git add .gitignore
$ git commit -m "Add .gitignore" 
#+END_SRC
* 建站

#+BEGIN_SRC bash
$ nikola init my_first_site
# Fill the asked information
# 把子文件信息弄到根目录来
$ mv my_first_site/* .
$ rm -r my_first_site 
#+END_SRC

#+BEGIN_SRC bash
$ git add conf.py
$ git commit -m "Add conf.py"
#+END_SRC


所有都设置好了，测试一下效果

#+BEGIN_SRC bash
 $ nikola build
 $ nikola serve 
#+END_SRC

=build= 用于渲染, =serve= 在本地测试。打开 http://localhost:8000 可以看到网页效果，按 C-c 停止

还有一个更为激进的自行探测改变并重新编译网站的命令 =auto=

#+BEGIN_SRC bash
 $ nikola auto 
#+END_SRC

清空之前的页面

#+BEGIN_SRC bash
 $ nikola clean
#+END_SRC

* 安装支持 org-mode 的官方插件
     - https://plugins.getnikola.com/#orgmode
     
     - 安装的命令 =nikola plugin -i orgmode=

     - 把 Configuration 写到conf.py 里
       #+BEGIN_SRC python
         # Add the orgmode compiler to your COMPILERS dict.
         COMPILERS["orgmode"] = ('.org',)

         # Add org files to your POSTS, PAGES
         POSTS = POSTS + (("posts/*.org", "posts", "post.tmpl"),)
         PAGES = PAGES + (("stories/*.org", "stories", "story.tmpl"),)
       #+END_SRC
     - 提交
       #+BEGIN_SRC bash
         $ git add plugins/orgmode conf.py
         $ git commit -m "Add org-mode support"
       #+END_SRC
* 写新文章

#+BEGIN_SRC bash
 $ nikola new_post -e -f orgmode 
#+END_SRC

=-e= 是打开文件进行编辑
=-f= 是指定 format，此处是使用 =orgmode= 格式

当然也可以手动在 posts/ 目录下新建文档, 还可以在里面新建多层目录, 非常灵活. metadata 中比较重要的有:

** metadata
*** tags 中可包含多个标签, 用逗号隔开.
 =draft= 表示该文不会被收入索引, 但它默认会被发布. 禁止发布带有 draft 标签的草稿, 在设置文件 conf.py 中设置 DEPLOY_DRAFTS 为 False. 当然前提是 DEPLOY_COMMANDS 中没包含 nikola build.

 tags 中含有 =private= 的post不会被收入索引, 但会被发布. 通过网址可以直接被访问到.

要显示latex公式, 需要在post的 tags 里加入 mathjax.
*** Post Types:
    text and micro. 前者为普通文章, 后者为微博.
*** nocomments:
    设置为 True 可以禁止本文的评论
*** password:
    可以为文章设置密码, 访问者需要输入密码才可以打开页面.
** Math
要显示latex公式, 需要在post的 tags 里加入 mathjax.

inline math 不再支持 $inline$ 形式, 而使用 \(inline\) (有的情况下需要使用 \\(inline\\)), 如

Euler’s formula: \(e^{ix} = \cos x + i\sin x\)
在reST文件中还可以使用 :math: (推荐):

Euler’s formula: :math:`e^{ix} = \cos x + i\sin x`
display math 使用 \[\], reST中推荐下面这种形式:
#+BEGIN_EXAMPLE
.. math::

   \int \frac{dx}{1+ax}=\frac{1}{a}\ln(1+ax)+C 
#+END_EXAMPLE


$a^2+b^2=c^2$

\[a^2+b^2=c^2\]

* 发布到 GitHub 上
修改 conf.py 文件

#+BEGIN_SRC python
 GITHUB_SOURCE_BRANCH = 'sources'
 GITHUB_DEPLOY_BRANCH = 'master'
#+END_SRC

使用下面的命令发布到 github 上
#+BEGIN_SRC bash
 $ nikola github_deploy 
#+END_SRC


* 配置

有三个配置文件, nikola 的 conf.py 和 orgmode 插件中 conf.el 和 init.el
