posts/yong-nikola-zai-github-shang-xie-bo-ke.html
<!DOCTYPE html>
<html prefix="og: http://ogp.me/ns# article: http://ogp.me/ns/article# " lang="zh_cn">
<head>
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>用 Nikola 在 GitHub 上写博客 | 赵骥's Site</title>
<link href="../assets/css/all-nocdn.css" rel="stylesheet" type="text/css">
<meta content="#5670d4" name="theme-color">
<link rel="alternate" type="application/rss+xml" title="RSS" href="../rss.xml">
<link rel="canonical" href="https://qiwulun.github.io/posts/yong-nikola-zai-github-shang-xie-bo-ke.html">
<!--[if lt IE 9]><![endif]--><link rel="stylesheet" href="//maxcdn.bootstrapcdn.com/font-awesome/4.4.0/css/font-awesome.min.css">
<link href="../mycss/tweak.css" rel="stylesheet" type="text/css">
<base target="_parent">
<meta name="author" content="Zhao JI">
<link rel="prev" href="first-post.html" title="Linux 软件整理" type="text/html">
<link rel="next" href="python-xiang-guan-de-nei-rong.html" title="Python 相关的内容" type="text/html">
<meta property="og:site_name" content="赵骥's Site">
<meta property="og:title" content="用 Nikola 在 GitHub 上写博客">
<meta property="og:url" content="https://qiwulun.github.io/posts/yong-nikola-zai-github-shang-xie-bo-ke.html">
<meta property="og:description" content="使用 Jekyll, Hexo 等框架在 GitHub Pages 上搭建静态个人博客越来越流行。



而我选用 Nikola 框架的原因是他原生支持 org-mode 文件的解析。此外，它是用 python 写成的，对于我这种不会 Ruby 的人，更为有亲和力。


 



1 安装 Nikola


安装 Nikola 非常简单 pip install Nikola[extras]



">
<meta property="og:type" content="article">
<meta property="article:published_time" content="2016-10-21T22:36:11+08:00">
<meta property="article:tag" content="mathjax">
</head>
<body>
<a href="#content" class="sr-only sr-only-focusable">跳到主内容</a>

<!-- Menubar -->

<nav class="navbar navbar-inverse navbar-static-top"><div class="container">
<!-- This keeps the margins nice -->
        <div class="navbar-header">
            <button type="button" class="navbar-toggle collapsed" data-toggle="collapse" data-target="#bs-navbar" aria-controls="bs-navbar" aria-expanded="false">
            <span class="sr-only">Toggle navigation</span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            <span class="icon-bar"></span>
            </button>
            <a class="navbar-brand" href="https://qiwulun.github.io/">

                <span id="blog-title">赵骥's Site</span>
            </a>
        </div>
<!-- /.navbar-header -->
        <div class="collapse navbar-collapse" id="bs-navbar" aria-expanded="false">
            <ul class="nav navbar-nav">
<li>
<a href="../archive.html">文章存档</a>
                </li>
<li>
<a href="../galleries/">图库</a>
                </li>
<li>
<a href="../categories/">标签</a>
                </li>
<li>
<a href="../rss.xml">RSS 源</a>

                
            </li>
</ul>
<ul class="nav navbar-nav navbar-right"></ul>
</div>
<!-- /.navbar-collapse -->
    </div>
<!-- /.container -->
</nav><!-- End of Menubar --><div class="container" id="content" role="main">
    <div class="body-content">
        <!--Body content-->
        <div class="row">
            
            
<article class="post-text h-entry hentry postpage" itemscope="itemscope" itemtype="http://schema.org/Article"><header><h1 class="p-name entry-title" itemprop="headline name"><a href="#" class="u-url">用 Nikola 在 GitHub 上写博客</a></h1>

        <div class="metadata">
            <p class="byline author vcard"><span class="byline-name fn">
                    Zhao JI
            </span></p>
            <p class="dateline"><a href="#" rel="bookmark"><time class="published dt-published" datetime="2016-10-21T22:36:11+08:00" itemprop="datePublished" title="2016-10-21 22:36">2016-10-21 22:36</time></a></p>
            

        </div>
        

    </header><div class="e-content entry-content" itemprop="articleBody text">
    <hr>
<p>
使用 Jekyll, Hexo 等框架在 GitHub Pages 上搭建静态个人博客越来越流行。
</p>

<p>
而我选用 Nikola 框架的原因是他原生支持 org-mode 文件的解析。此外，它是用 python 写成的，对于我这种不会 Ruby 的人，更为有亲和力。
</p>

<!-- TEASER_END --> 


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">
<span class="section-number-2">1</span> 安装 Nikola</h2>
<div class="outline-text-2" id="text-1">
<p>
安装 Nikola 非常简单 <code>pip install Nikola[extras]</code>
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">
<span class="section-number-2">2</span> 新建一个 GitHub pages</h2>
<div class="outline-text-2" id="text-2">
<p>
新建一个空的 GitHub Repository, 并 clone 到你的电脑上
</p>

<div class="highlight"><pre><span></span>$ git clone git@github.com:&lt;username&gt;.github.io.git ~/blog
</pre></div>

<p>
这个库将包含两个分支：master 渲染好的网页， sources 原始文件。所以我们要新建一个分支 sources
</p>

<div class="highlight"><pre><span></span>$ cd ~/blog
$ git checkout -b sources
</pre></div>

<p>
新建一个 .gitignore 文件
</p>
<pre class="example">
*.py[cod]
__pycache__
cache
output
.doit.db
_env/
</pre>

<p>
commit 到 source 分支
</p>

<div class="highlight"><pre><span></span>$ git add .gitignore
$ git commit -m "Add .gitignore"
</pre></div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">
<span class="section-number-2">3</span> 建站</h2>
<div class="outline-text-2" id="text-3">
<div class="highlight"><pre><span></span>$ nikola init my_first_site
# Fill the asked information
# 把子文件信息弄到根目录来
$ mv my_first_site/* .
$ rm -r my_first_site
</pre></div>

<div class="highlight"><pre><span></span>$ git add conf.py
$ git commit -m "Add conf.py"
</pre></div>


<p>
所有都设置好了，测试一下效果
</p>

<div class="highlight"><pre><span></span>$ nikola build
$ nikola serve
</pre></div>

<p>
<code>build</code> 用于渲染, <code>serve</code> 在本地测试。打开 <a href="http://localhost:8000">http://localhost:8000</a> 可以看到网页效果，按 C-c 停止
</p>

<p>
还有一个更为激进的自行探测改变并重新编译网站的命令 <code>auto</code>
</p>

<div class="highlight"><pre><span></span>$ nikola auto
</pre></div>

<p>
清空之前的页面
</p>

<div class="highlight"><pre><span></span>$ nikola clean
</pre></div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">
<span class="section-number-2">4</span> 安装支持 org-mode 的官方插件</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>
<a href="https://plugins.getnikola.com/#orgmode">https://plugins.getnikola.com/#orgmode</a>
</li>

<li>安装的命令 <code>nikola plugin -i orgmode</code>
</li>

<li>把 Configuration 写到conf.py 里
<div class="highlight"><pre><span></span><span class="c1"># Add the orgmode compiler to your COMPILERS dict.</span>
<span class="n">COMPILERS</span><span class="p">[</span><span class="s2">"orgmode"</span><span class="p">]</span> <span class="o">=</span> <span class="p">(</span><span class="s1">'.org'</span><span class="p">,)</span>

<span class="c1"># Add org files to your POSTS, PAGES</span>
<span class="n">POSTS</span> <span class="o">=</span> <span class="n">POSTS</span> <span class="o">+</span> <span class="p">((</span><span class="s2">"posts/*.org"</span><span class="p">,</span> <span class="s2">"posts"</span><span class="p">,</span> <span class="s2">"post.tmpl"</span><span class="p">),)</span>
<span class="n">PAGES</span> <span class="o">=</span> <span class="n">PAGES</span> <span class="o">+</span> <span class="p">((</span><span class="s2">"stories/*.org"</span><span class="p">,</span> <span class="s2">"stories"</span><span class="p">,</span> <span class="s2">"story.tmpl"</span><span class="p">),)</span>
</pre></div>
</li>
<li>提交
<div class="highlight"><pre><span></span>$ git add plugins/orgmode conf.py
$ git commit -m "Add org-mode support"
</pre></div>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">
<span class="section-number-2">5</span> 写新文章</h2>
<div class="outline-text-2" id="text-5">
<div class="highlight"><pre><span></span>$ nikola new_post -e -f orgmode
</pre></div>

<p>
<code>-e</code> 是打开文件进行编辑
<code>-f</code> 是指定 format，此处是使用 <code>orgmode</code> 格式
</p>

<p>
当然也可以手动在 posts/ 目录下新建文档, 还可以在里面新建多层目录, 非常灵活. metadata 中比较重要的有:
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">
<span class="section-number-3">5.1</span> metadata</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-sec-5-1-1" class="outline-4">
<h4 id="sec-5-1-1">
<span class="section-number-4">5.1.1</span> tags 中可包含多个标签, 用逗号隔开.</h4>
<div class="outline-text-4" id="text-5-1-1">
<p>
<code>draft</code> 表示该文不会被收入索引, 但它默认会被发布. 禁止发布带有 draft 标签的草稿, 在设置文件 conf.py 中设置 DEPLOY<sub>DRAFTS</sub> 为 False. 当然前提是 DEPLOY<sub>COMMANDS</sub> 中没包含 nikola build.
</p>

<p>
tags 中含有 <code>private</code> 的post不会被收入索引, 但会被发布. 通过网址可以直接被访问到.
</p>

<p>
要显示latex公式, 需要在post的 tags 里加入 mathjax.
</p>
</div>
</div>
<div id="outline-container-sec-5-1-2" class="outline-4">
<h4 id="sec-5-1-2">
<span class="section-number-4">5.1.2</span> Post Types:</h4>
<div class="outline-text-4" id="text-5-1-2">
<p>
text and micro. 前者为普通文章, 后者为微博.
</p>
</div>
</div>
<div id="outline-container-sec-5-1-3" class="outline-4">
<h4 id="sec-5-1-3">
<span class="section-number-4">5.1.3</span> nocomments:</h4>
<div class="outline-text-4" id="text-5-1-3">
<p>
设置为 True 可以禁止本文的评论
</p>
</div>
</div>
<div id="outline-container-sec-5-1-4" class="outline-4">
<h4 id="sec-5-1-4">
<span class="section-number-4">5.1.4</span> password:</h4>
<div class="outline-text-4" id="text-5-1-4">
<p>
可以为文章设置密码, 访问者需要输入密码才可以打开页面.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">
<span class="section-number-3">5.2</span> Math</h3>
<div class="outline-text-3" id="text-5-2">
<p>
要显示latex公式, 需要在post的 tags 里加入 mathjax.
</p>

<p>
inline math 不再支持 \(inline\) 形式, 而使用 \(inline\) (有的情况下需要使用 \\(inline\\)), 如
</p>

<p>
Euler’s formula: \(e^{ix} = \cos x + i\sin x\)
在reST文件中还可以使用 :math: (推荐):
</p>

<p>
Euler’s formula: :math:`e<sup>ix</sup> = cos x + isin x`
display math 使用 \[\], reST中推荐下面这种形式:
</p>
<pre class="example">
.. math::

   \int \frac{dx}{1+ax}=\frac{1}{a}\ln(1+ax)+C
</pre>


<p>
\(a^2+b^2=c^2\)
</p>

<p>
\[a^2+b^2=c^2\]
</p>
</div>
</div>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">
<span class="section-number-2">6</span> 发布到 GitHub 上</h2>
<div class="outline-text-2" id="text-6">
<p>
修改 conf.py 文件
</p>

<div class="highlight"><pre><span></span><span class="n">GITHUB_SOURCE_BRANCH</span> <span class="o">=</span> <span class="s1">'sources'</span>
<span class="n">GITHUB_DEPLOY_BRANCH</span> <span class="o">=</span> <span class="s1">'master'</span>
</pre></div>

<p>
使用下面的命令发布到 github 上
</p>
<div class="highlight"><pre><span></span>$ nikola github_deploy
</pre></div>
</div>
</div>


<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7">
<span class="section-number-2">7</span> 配置</h2>
<div class="outline-text-2" id="text-7">
<p>
有三个配置文件, nikola 的 conf.py 和 orgmode 插件中 conf.el 和 init.el
</p>
</div>
