posts/yong-nikola-zai-github-shang-xie-bo-ke.org
** 更改模板
 Nikola 提供大量的模板，见这里，

安装的命令
#+BEGIN_SRC bash
 $ nikola install_theme <theme_name> 
#+END_SRC

更改 =conf.py= 来选择模板， 
#+BEGIN_SRC python
 THEME = "<theme_name>" 
#+END_SRC

有些模板要进一步配置，请看他们的网页说明。

Themes can be found here https://themes.getnikola.com/

and installed with nikola install_theme themename. Here bootstrap3 is a very good choice among them, since it supports Bootswatch https://bootswatch.com/ schemes. For example, to use Superhero scheme on this page https://bootswatch.com/superhero/ , just run

#+BEGIN_SRC bash
$ nikola install_theme bootstrap3
$ nikola bootswatch_theme -n custum_theme -s superhero -p bootstrap3 
#+END_SRC

 after installing bootstrap3 theme. To enable this custom scheme, you need set =THEME= to =custom= in conf.py.

 To further tweak your theme, please refer to Theming Nikola.

** 图片显示
    图片插入有一点小问题，输出的路径必须比实际路径更上一层，比如
    =../images/logo.png= 要写成 =../../images/logo.png= ，不然在网页中就找不到了

    为了让图片在 =org= 文件中与网页中都能正常显示，我们要改一个 =conf.py= 的设定，不然错一层文件夹，显示不出来

    'images': 'posts/images'

** 语法高亮
    默认使用 =pygments= ，可以在 =init.el= 或 =conf.el= 中把
=nikola-use-pygments= 改成 =nil= 来取消它。

为了正常显示语法高亮，需要增加相应的 =custom.css= ，并确保 =custom.css= 被 =theme= 使用了

用 pygmentize 生成相应的 css 文件， <PYGMENTS_STYLE> 可以用 =pygmentize -L style= 查看，比如 colorful,friendly

   #+BEGIN_SRC bash
      mkdir -p files/assets/css
      pygmentize -S <PYGMENTS_STYLE> -a .highlight -f html >> files/assets/css/custom.css
   #+END_SRC


** 首页摘要
INDEX_TEASERS 设为 True 可以启用teaser. (默认是False，只在 RSS 中显示摘要） 

这时只需在每个post中加入 =.. TEASER_END= (reST文件) 或 =<!--TEASER_END-->=
 (markdown), 就可以使index page只显示post的第一部 分, 而对于org-mode, 需要
 =#+HTML: <!--TEASER_END-->= 或者

#+BEGIN_SRC org
  ,#+BEGIN_HTML
  <!--TEASER_END-->
  ,#+END_HTML
#+END_SRC
另外,

#+BEGIN_SRC python
INDEX_READ_MORE_LINK = ""
FEED_READ_MORE_LINK = "" 
#+END_SRC
可以禁止掉 “Reader more…”. 个人感觉没有必要, 因为禁掉后读者不能分清楚是否文章在这里真的已经完结还是只是摘要部分.

** 使用 markdown 或 ipython 做源文件
如果页面要使用markdown和ipython notebook, 需要设置 POSTS 与 PAGES 项(下面各增加了后两项, 顺便吐槽在nikola中page居然被叫做story!!!):

POSTS = (
    ("posts/*.rst", "posts", "post.tmpl"),
    ("posts/*.txt", "posts", "post.tmpl"),
    ("posts/*.html", "posts", "post.tmpl"),
    ("posts/*.md", "posts", "post.tmpl"),
    ("posts/*.ipynb", "posts", "post.tmpl"),
)
PAGES = (
    ("stories/*.rst", "stories", "story.tmpl"),
    ("stories/*.txt", "stories", "story.tmpl"),
    ("stories/*.html", "stories", "story.tmpl"),
    ("stories/*.md", "stories", "story.tmpl"),
    ("stories/*.ipynb", "stories", "story.tmpl"),
)

** 把元数据与文章分离开
 一开始的元数据，如更新时间等都是在 org 文件中的，可以把它们分离到单独的文件中。修改 =conf.py= 文件

#+BEGIN_SRC python
 ONE_FILE_POSTS = False 
#+END_SRC

** 显示目录，小标题编号

在 init.el 文件中修改
#+BEGIN_SRC emacs-lisp
;;; Add any custom configuration that you would like to 'conf.el'.
(setq
 nikola-use-pygments t
 org-export-with-toc t
 org-export-with-section-numbers nil
 org-startup-folded 'showeverything) 
#+END_SRC


也可以用 org 文件头来控制
#+BEGIN_SRC org
  ,#+OPTIONS: num:t 
#+END_SRC
** 站点信息
在 conf.py 中
#+BEGIN_SRC python
BLOG_AUTHOR = "Your Name"
BLOG_TITLE = "Demo Site"
BLOG_URL = "http://nikola.ralsina.com.ar"
BLOG_EMAIL = "joe@demo.site"
BLOG_DESCRIPTION = "This is a demo site for Nikola."
#+END_SRC

** 通用文章信息
我们可以将一些信息(比如作者)放在 conf.py 中, 这样所有post都不用再指定作者信息了:

ADDITIONAL_METADATA = {
    'author': 'defnil'
}

** webassets 加速
USE_BUNDLES 设为 True 可以启用webassets (前提是你已经安装了它), 这样可以获得速度上的提升.

** 禁止评论功能:

在 conf.py 中
#+BEGIN_SRC python
COMMENT_SYSTEM = "" 
#+END_SRC
也可以选择启用其它的评论支持, 如disqus, facebook等.

** RSS
在 conf.py 中 GENERATE_RSS 设为 True 默认支持RSS, 如果设为 False, 则会关闭任何与RSS相关的功能. 同时还需要在 NAVIGATION_LINKS 把和RSS相关的页面去掉

** SourceLinks
在 conf.py 中 去掉Source links, 页面上将不会显示页面源代码的链接

#+BEGIN_SRC python
SHOW_SOURCELINK = False
COPY_SOURCES = False
#+END_SRC
** Use Custom Domain
比如, 我们现在已经购买了域名 abc.me, 希望能与刚才创建的Github页面关联. 假设我们用的是上述方法一来管理和发布页面的. 则先在本地的 files/ 目录下添加 CNAME 文件, 其内容很简单, 只有 abc.me. 可以用下面的命令实现:

cd C:/home/mynikolasite
echo "abc.me" > files/CNAME
**  Author Page
 如果你每篇post的作者署名不一致, nikola会判断有多个作者, 因此会自动产生一个Author Page. 当点击每个post上的Author名时, 会转向这名作者的页面. 因此需要按此 说明 https://getnikola.com/blog/author-pages-in-nikola-v770.html 进一步设置. 即: 将 AUTHOR_PAGES_ARE_INDEXES 设为 False, 然后设置每个作者的描述:

#+BEGIN_SRC python
 ENABLE_AUTHOR_PAGES = True
 AUTHOR_PAGES_ARE_INDEXES = False
 AUTHOR_PATH = "authors"
 AUTHOR_PAGES_DESCRIPTIONS = {
     DEFAULT_LANG: {
         "defnil": "Old posts",
         "YONG": "^_^"
     },
 }
 HIDDEN_AUTHORS = ['Guest']

#+END_SRC
 bootstrap3 主题已将这些页面包含在内, 因此作上述设置后就可以直接看到结果了. 如果你要完全禁止这个功能, 也很简单, 将 ENABLE_AUTHOR_PAGES 设为 False 即可.

** Footer
 这里主要是在页面下显示 “Contents 2016 authorname - Powered by Nikola” 字样. 可以在 CONTENT_FOOTER 中做修改.

