posts/yong-nikola-zai-github-shang-xie-bo-ke.html
<div id="outline-container-sec-7-1" class="outline-3">
<h3 id="sec-7-1">
<span class="section-number-3">7.1</span> 更改模板</h3>
<div class="outline-text-3" id="text-7-1">
<p>
Nikola 提供大量的模板，见这里，
</p>

<p>
安装的命令
</p>
<div class="highlight"><pre><span></span>$ nikola install_theme &lt;theme_name&gt;
</pre></div>

<p>
更改 <code>conf.py</code> 来选择模板， 
</p>
<div class="highlight"><pre><span></span><span class="n">THEME</span> <span class="o">=</span> <span class="s2">"&lt;theme_name&gt;"</span>
</pre></div>

<p>
有些模板要进一步配置，请看他们的网页说明。
</p>

<p>
Themes can be found here <a href="https://themes.getnikola.com/">https://themes.getnikola.com/</a>
</p>

<p>
and installed with nikola install<sub>theme</sub> themename. Here bootstrap3 is a very good choice among them, since it supports Bootswatch <a href="https://bootswatch.com/">https://bootswatch.com/</a> schemes. For example, to use Superhero scheme on this page <a href="https://bootswatch.com/superhero/">https://bootswatch.com/superhero/</a> , just run
</p>

<div class="highlight"><pre><span></span>$ nikola install_theme bootstrap3
$ nikola bootswatch_theme -n custum_theme -s superhero -p bootstrap3
</pre></div>

<p>
after installing bootstrap3 theme. To enable this custom scheme, you need set <code>THEME</code> to <code>custom</code> in conf.py.
</p>

<p>
To further tweak your theme, please refer to Theming Nikola.
</p>
</div>
</div>

<div id="outline-container-sec-7-2" class="outline-3">
<h3 id="sec-7-2">
<span class="section-number-3">7.2</span> 图片显示</h3>
<div class="outline-text-3" id="text-7-2">
<p>
图片插入有一点小问题，输出的路径必须比实际路径更上一层，比如
<code>../images/logo.png</code> 要写成 <code>../../images/logo.png</code> ，不然在网页中就找不到了
</p>

<p>
为了让图片在 <code>org</code> 文件中与网页中都能正常显示，我们要改一个 <code>conf.py</code> 的设定，不然错一层文件夹，显示不出来
</p>

<p>
'images': 'posts/images'
</p>
</div>
</div>

<div id="outline-container-sec-7-3" class="outline-3">
<h3 id="sec-7-3">
<span class="section-number-3">7.3</span> 语法高亮</h3>
<div class="outline-text-3" id="text-7-3">
<p>
默认使用 <code>pygments</code> ，可以在 <code>init.el</code> 或 <code>conf.el</code> 中把
<code>nikola-use-pygments</code> 改成 <code>nil</code> 来取消它。
</p>

<p>
为了正常显示语法高亮，需要增加相应的 <code>custom.css</code> ，并确保 <code>custom.css</code> 被 <code>theme</code> 使用了
</p>

<p>
用 pygmentize 生成相应的 css 文件， &lt;PYGMENTS<sub>STYLE</sub>&gt; 可以用 <code>pygmentize -L style</code> 查看，比如 colorful,friendly
</p>

<div class="highlight"><pre><span></span>mkdir -p files/assets/css
pygmentize -S &lt;PYGMENTS_STYLE&gt; -a .highlight -f html &gt;&gt; files/assets/css/custom.css
</pre></div>
</div>
</div>


<div id="outline-container-sec-7-4" class="outline-3">
<h3 id="sec-7-4">
<span class="section-number-3">7.4</span> 首页摘要</h3>
<div class="outline-text-3" id="text-7-4">
<p>
INDEX<sub>TEASERS</sub> 设为 True 可以启用teaser. (默认是False，只在 RSS 中显示摘要） 
</p>

<p>
这时只需在每个post中加入 <code>.. TEASER_END</code> (reST文件) 或 <code>&lt;!--TEASER_END--&gt;</code>
 (markdown), 就可以使index page只显示post的第一部 分, 而对于org-mode, 需要
 <code>#+HTML: &lt;!--TEASER_END--&gt;</code> 或者
</p>

<div class="highlight"><pre><span></span>#+BEGIN_HTML
&lt;!--TEASER_END--&gt;
#+END_HTML
</pre></div>
<p>
另外,
</p>

<div class="highlight"><pre><span></span><span class="n">INDEX_READ_MORE_LINK</span> <span class="o">=</span> <span class="s2">""</span>
<span class="n">FEED_READ_MORE_LINK</span> <span class="o">=</span> <span class="s2">""</span>
</pre></div>
<p>
可以禁止掉 “Reader more…”. 个人感觉没有必要, 因为禁掉后读者不能分清楚是否文章在这里真的已经完结还是只是摘要部分.
</p>
</div>
</div>

<div id="outline-container-sec-7-5" class="outline-3">
<h3 id="sec-7-5">
<span class="section-number-3">7.5</span> 使用 markdown 或 ipython 做源文件</h3>
<div class="outline-text-3" id="text-7-5">
<p>
如果页面要使用markdown和ipython notebook, 需要设置 POSTS 与 PAGES 项(下面各增加了后两项, 顺便吐槽在nikola中page居然被叫做story!!!):
</p>

<p>
POSTS = (
    ("posts/*.rst", "posts", "post.tmpl"),
    ("posts/*.txt", "posts", "post.tmpl"),
    ("posts/*.html", "posts", "post.tmpl"),
    ("posts/*.md", "posts", "post.tmpl"),
    ("posts/*.ipynb", "posts", "post.tmpl"),
)
PAGES = (
    ("stories/*.rst", "stories", "story.tmpl"),
    ("stories/*.txt", "stories", "story.tmpl"),
    ("stories/*.html", "stories", "story.tmpl"),
    ("stories/*.md", "stories", "story.tmpl"),
    ("stories/*.ipynb", "stories", "story.tmpl"),
)
</p>
</div>
</div>

<div id="outline-container-sec-7-6" class="outline-3">
<h3 id="sec-7-6">
<span class="section-number-3">7.6</span> 把元数据与文章分离开</h3>
<div class="outline-text-3" id="text-7-6">
<p>
一开始的元数据，如更新时间等都是在 org 文件中的，可以把它们分离到单独的文件中。修改 <code>conf.py</code> 文件
</p>

<div class="highlight"><pre><span></span><span class="n">ONE_FILE_POSTS</span> <span class="o">=</span> <span class="bp">False</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-7-7" class="outline-3">
<h3 id="sec-7-7">
<span class="section-number-3">7.7</span> 显示目录，小标题编号</h3>
<div class="outline-text-3" id="text-7-7">
<p>
在 init.el 文件中修改
</p>
<div class="highlight"><pre><span></span><span class="c1">;;; Add any custom configuration that you would like to 'conf.el'.</span>
<span class="p">(</span><span class="nf">setq</span>
 <span class="nv">nikola-use-pygments</span> <span class="nv">t</span>
 <span class="nv">org-export-with-toc</span> <span class="nv">t</span>
 <span class="nv">org-export-with-section-numbers</span> <span class="nv">nil</span>
 <span class="nv">org-startup-folded</span> <span class="ss">'showeverything</span><span class="p">)</span>
</pre></div>


<p>
也可以用 org 文件头来控制
</p>
<div class="highlight"><pre><span></span>#+OPTIONS: num:t
</pre></div>
</div>
</div>
<div id="outline-container-sec-7-8" class="outline-3">
<h3 id="sec-7-8">
<span class="section-number-3">7.8</span> 站点信息</h3>
<div class="outline-text-3" id="text-7-8">
<p>
在 conf.py 中
</p>
<div class="highlight"><pre><span></span><span class="n">BLOG_AUTHOR</span> <span class="o">=</span> <span class="s2">"Your Name"</span>
<span class="n">BLOG_TITLE</span> <span class="o">=</span> <span class="s2">"Demo Site"</span>
<span class="n">BLOG_URL</span> <span class="o">=</span> <span class="s2">"http://nikola.ralsina.com.ar"</span>
<span class="n">BLOG_EMAIL</span> <span class="o">=</span> <span class="s2">"joe@demo.site"</span>
<span class="n">BLOG_DESCRIPTION</span> <span class="o">=</span> <span class="s2">"This is a demo site for Nikola."</span>
</pre></div>
</div>
</div>

<div id="outline-container-sec-7-9" class="outline-3">
<h3 id="sec-7-9">
<span class="section-number-3">7.9</span> 通用文章信息</h3>
<div class="outline-text-3" id="text-7-9">
<p>
我们可以将一些信息(比如作者)放在 conf.py 中, 这样所有post都不用再指定作者信息了:
</p>

<p>
ADDITIONAL<sub>METADATA</sub> = {
    'author': 'defnil'
}
</p>
</div>
</div>

<div id="outline-container-sec-7-10" class="outline-3">
<h3 id="sec-7-10">
<span class="section-number-3">7.10</span> webassets 加速</h3>
<div class="outline-text-3" id="text-7-10">
<p>
USE<sub>BUNDLES</sub> 设为 True 可以启用webassets (前提是你已经安装了它), 这样可以获得速度上的提升.
</p>
</div>
</div>

<div id="outline-container-sec-7-11" class="outline-3">
<h3 id="sec-7-11">
<span class="section-number-3">7.11</span> 禁止评论功能:</h3>
<div class="outline-text-3" id="text-7-11">
<p>
在 conf.py 中
</p>
<div class="highlight"><pre><span></span><span class="n">COMMENT_SYSTEM</span> <span class="o">=</span> <span class="s2">""</span>
</pre></div>
<p>
也可以选择启用其它的评论支持, 如disqus, facebook等.
</p>
</div>
</div>

<div id="outline-container-sec-7-12" class="outline-3">
<h3 id="sec-7-12">
<span class="section-number-3">7.12</span> RSS</h3>
<div class="outline-text-3" id="text-7-12">
<p>
在 conf.py 中 GENERATE<sub>RSS</sub> 设为 True 默认支持RSS, 如果设为 False, 则会关闭任何与RSS相关的功能. 同时还需要在 NAVIGATION<sub>LINKS</sub> 把和RSS相关的页面去掉
</p>
</div>
</div>

<div id="outline-container-sec-7-13" class="outline-3">
<h3 id="sec-7-13">
<span class="section-number-3">7.13</span> SourceLinks</h3>
<div class="outline-text-3" id="text-7-13">
<p>
在 conf.py 中 去掉Source links, 页面上将不会显示页面源代码的链接
</p>

<div class="highlight"><pre><span></span><span class="n">SHOW_SOURCELINK</span> <span class="o">=</span> <span class="bp">False</span>
<span class="n">COPY_SOURCES</span> <span class="o">=</span> <span class="bp">False</span>
</pre></div>
</div>
</div>
<div id="outline-container-sec-7-14" class="outline-3">
<h3 id="sec-7-14">
<span class="section-number-3">7.14</span> Use Custom Domain</h3>
<div class="outline-text-3" id="text-7-14">
<p>
比如, 我们现在已经购买了域名 abc.me, 希望能与刚才创建的Github页面关联. 假设我们用的是上述方法一来管理和发布页面的. 则先在本地的 files/ 目录下添加 CNAME 文件, 其内容很简单, 只有 abc.me. 可以用下面的命令实现:
</p>

<p>
cd C:/home/mynikolasite
echo "abc.me" &gt; files/CNAME
</p>
</div>
</div>
<div id="outline-container-sec-7-15" class="outline-3">
<h3 id="sec-7-15">
<span class="section-number-3">7.15</span> Author Page</h3>
<div class="outline-text-3" id="text-7-15">
<p>
如果你每篇post的作者署名不一致, nikola会判断有多个作者, 因此会自动产生一个Author Page. 当点击每个post上的Author名时, 会转向这名作者的页面. 因此需要按此 说明 <a href="https://getnikola.com/blog/author-pages-in-nikola-v770.html">https://getnikola.com/blog/author-pages-in-nikola-v770.html</a> 进一步设置. 即: 将 AUTHOR<sub>PAGES</sub><sub>ARE</sub><sub>INDEXES</sub> 设为 False, 然后设置每个作者的描述:
</p>

<div class="highlight"><pre><span></span><span class="n">ENABLE_AUTHOR_PAGES</span> <span class="o">=</span> <span class="bp">True</span>
<span class="n">AUTHOR_PAGES_ARE_INDEXES</span> <span class="o">=</span> <span class="bp">False</span>
<span class="n">AUTHOR_PATH</span> <span class="o">=</span> <span class="s2">"authors"</span>
<span class="n">AUTHOR_PAGES_DESCRIPTIONS</span> <span class="o">=</span> <span class="p">{</span>
    <span class="n">DEFAULT_LANG</span><span class="p">:</span> <span class="p">{</span>
	<span class="s2">"defnil"</span><span class="p">:</span> <span class="s2">"Old posts"</span><span class="p">,</span>
	<span class="s2">"YONG"</span><span class="p">:</span> <span class="s2">"^_^"</span>
    <span class="p">},</span>
<span class="p">}</span>
<span class="n">HIDDEN_AUTHORS</span> <span class="o">=</span> <span class="p">[</span><span class="s1">'Guest'</span><span class="p">]</span>
</pre></div>
<p>
bootstrap3 主题已将这些页面包含在内, 因此作上述设置后就可以直接看到结果了. 如果你要完全禁止这个功能, 也很简单, 将 ENABLE<sub>AUTHOR</sub><sub>PAGES</sub> 设为 False 即可.
</p>
</div>
</div>

<div id="outline-container-sec-7-16" class="outline-3">
<h3 id="sec-7-16">
<span class="section-number-3">7.16</span> Footer</h3>
<div class="outline-text-3" id="text-7-16">
<p>
这里主要是在页面下显示 “Contents 2016 authorname - Powered by Nikola” 字样. 可以在 CONTENT<sub>FOOTER</sub> 中做修改.
</p>
</div>
</div>
