posts/yong-nikola-zai-github-shang-xie-bo-ke.org
** Navigation Pane
 可以在 NAVIGATION_LINKS 里添加要链接的页面即可. 比如新建了一个名为 about.rst 的page (会被存放在 stories/ 目录下), 如果要将它放在导航栏里:

 NAVIGATION_LINKS = {
     DEFAULT_LANG: (
         ("/archive.html", "Archive"),
         ("/categories/", "Tags"),
         ("/stories/about/index.html", "About"), # need to be changed to /output/index.html after you set your own homepage
         #("/rss.xml", "RSS feed"),
     ),
 }
 根据 Nikola Handbook https://getnikola.com/handbook.html 的说法, 导航栏至多支持一级子菜单 “Only one level of submenus is supported”, 可以参照说明设置带子菜单样式的导航栏.

** 评论功能 DISQUS
 COMMENT_SYSTEM = "disqus"
 COMMENT_SYSTEM_ID = "yongch" # your disqus ID

** Image Size
 MAX_IMAGE_SIZE 可以决定图片大小, 设置一个合理的数字可以保证所有页面中的图片不至于太大. 还有其它关于image的选项可以酌情选择.

 另外所有放在 images/ 下面的图片都会被复制到 output/ 里并且会为每张图片自动生成thumbnail图片. 因此如果不想产生Thumbnail, 就直接把图片放在 files/images/ 目录下.

** Set Your Own Homepage
 让网页更像site而不是blog, 这里 https://getnikola.com/creating-a-site-not-a-blog-with-nikola.html 有如何建一个site的步骤. 对于已经按blog建立的站点, 我们可以进行下面的改造.

#+BEGIN_SRC python
 INDEX_PATH = "posts"
 PAGES = (
     ("stories/*.rst", "", "story.tmpl"), # Must use "" to put generated pages directly under the root directory
     ("stories/*.md", "", "story.tmpl"),
     ("stories/*.org", "", "story.tmpl"),
     ("stories/*.txt", "", "story.tmpl"),
     ("stories/*.html", "", "story.tmpl"),
     ("stories/*.ipynb", "", "story.tmpl"),
 )
#+END_SRC

 然后我们可以使用 nikola new_page -t Home 创建一个名为 “Home” 的页面. (slug 改为index). 现在我们还需要根据 output/ 下目录的变化重新调整导航栏, 并且把posts放到 “Blog” 导航栏里.

#+BEGIN_SRC python
 NAVIGATION_LINKS = {
     DEFAULT_LANG: (
         ("/posts/", "Blog"),
                     ("/categories/", "Tags"),
         ("/archive.html", "Archive"),
         ("/about/index.html", "About"),
                     ("/rss.xml", "RSS feed"),
     ),
 }
#+END_SRC

 这时可以编辑你自己的 home.rst 了. 也可以直接用我们之前做的 about.rst 链接过来做主页: .. include:: stories/about.rst. 如果你正在使用基于 bootstrap3 的主题, 因为它基于 Bootstrap, 因此任何 Bootstrap 支持的格式都可以用 .rst 来表达. 可以参考 这里 https://getnikola.com/creating-a-site-not-a-blog-with-nikola.html 的一个例子来写主页. 更多语法上的参考还可以看 这里 https://github.com/rougier/bootstrap-rst .
* 其它输入格式

** reST中插入多种格式
*** media

#+BEGIN_EXAMPLE
 .. media:: http://vimeo.com/72425090
 .. media:: http://www.youtube.com/watch?v=wyRpAat5oz0
#+END_EXAMPLE
*** YouTube, Vimeo, Soundcloud

#+BEGIN_EXAMPLE
 .. youtube:: 8N_tupPBtWQ

 .. vimeo:: 20241459

 .. vimeo:: 20241459
    :height: 240
    :width: 320

 [soundcloud url="http://api.soundcloud.com/tracks/78131362"

 .. soundcloud:: 78131362
#+END_EXAMPLE
*** Code

#+BEGIN_EXAMPLE
 .. code-block:: python
    :number-lines:

    print("Our virtues and our failings are inseparable")
#+END_EXAMPLE
*** Listing

 将 foo.py 文件放在 LISTINGS_FOLDERS 指定的目录下.

#+BEGIN_EXAMPLE

 .. listing:: foo.py python
#+END_EXAMPLE
*** Gist

#+BEGIN_SRC 
 .. gist:: 2395294
#+END_SRC
*** Thumbnails

 To include an image placed in the images folder (or other folders defined in IMAGEFOLDERS), use the thumbnail directive, like this:
#+BEGIN_EXAMPLE
 .. thumbnail:: ../tesla.jpg

    Nikola Tesla, the man that invented the 20th century.
#+END_EXAMPLE
*** Slideshows

#+BEGIN_EXAMPLE
 .. slides::

    /galleries/demo/tesla_conducts_lg.jpg
    /galleries/demo/tesla_lightning2_lg.jpg
    /galleries/demo/tesla4_lg.jpg
    /galleries/demo/tesla_lightning1_lg.jpg
    /galleries/demo/tesla_tower1_lg.jpg

#+END_EXAMPLE
*** Chart

 可以参考 这里 http://www.pygal.org/en/latest/

#+BEGIN_EXAMPLE
 .. chart:: Bar
    :title: 'Browser usage evolution (in %)'
    :x_labels: ["2002", "2003", "2004", "2005", "2006", "2007"]
    'Firefox', [None, None, 0, 16.6, 25, 31]
    'Chrome',  [None, None, None, None, None, None]
    'IE',      [85.8, 84.6, 84.7, 74.5, 66, 58.6]
    'Others',  [14.2, 15.4, 15.3, 8.9, 9, 10.4]
#+END_EXAMPLE
*** Doc

 用于跳转到其它页面.

#+BEGIN_EXAMPLE
 Take a look at :doc:`my other post <creating-a-theme>` about theme creating.
 Take a look at :doc:`creating-a-theme` to know how to do it.
#+END_EXAMPLE
** Markdown
