posts/yong-nikola-zai-github-shang-xie-bo-ke.html

<div id="outline-container-sec-7-17" class="outline-3">
<h3 id="sec-7-17">
<span class="section-number-3">7.17</span> Navigation Pane</h3>
<div class="outline-text-3" id="text-7-17">
<p>
可以在 NAVIGATION<sub>LINKS</sub> 里添加要链接的页面即可. 比如新建了一个名为 about.rst 的page (会被存放在 stories/ 目录下), 如果要将它放在导航栏里:
</p>

<p>
NAVIGATION<sub>LINKS</sub> = {
    DEFAULT<sub>LANG</sub>: (
        ("<i>archive.html", "Archive"),
        ("/categories</i>", "Tags"),
        ("/stories/about/index.html", "About"), # need to be changed to /output/index.html after you set your own homepage
        #("/rss.xml", "RSS feed"),
    ),
}
根据 Nikola Handbook <a href="https://getnikola.com/handbook.html">https://getnikola.com/handbook.html</a> 的说法, 导航栏至多支持一级子菜单 “Only one level of submenus is supported”, 可以参照说明设置带子菜单样式的导航栏.
</p>
</div>
</div>

<div id="outline-container-sec-7-18" class="outline-3">
<h3 id="sec-7-18">
<span class="section-number-3">7.18</span> 评论功能 DISQUS</h3>
<div class="outline-text-3" id="text-7-18">
<p>
COMMENT<sub>SYSTEM</sub> = "disqus"
COMMENT<sub>SYSTEM</sub><sub>ID</sub> = "yongch" # your disqus ID
</p>
</div>
</div>

<div id="outline-container-sec-7-19" class="outline-3">
<h3 id="sec-7-19">
<span class="section-number-3">7.19</span> Image Size</h3>
<div class="outline-text-3" id="text-7-19">
<p>
MAX<sub>IMAGE</sub><sub>SIZE</sub> 可以决定图片大小, 设置一个合理的数字可以保证所有页面中的图片不至于太大. 还有其它关于image的选项可以酌情选择.
</p>

<p>
另外所有放在 images/ 下面的图片都会被复制到 output/ 里并且会为每张图片自动生成thumbnail图片. 因此如果不想产生Thumbnail, 就直接把图片放在 files/images/ 目录下.
</p>
</div>
</div>

<div id="outline-container-sec-7-20" class="outline-3">
<h3 id="sec-7-20">
<span class="section-number-3">7.20</span> Set Your Own Homepage</h3>
<div class="outline-text-3" id="text-7-20">
<p>
让网页更像site而不是blog, 这里 <a href="https://getnikola.com/creating-a-site-not-a-blog-with-nikola.html">https://getnikola.com/creating-a-site-not-a-blog-with-nikola.html</a> 有如何建一个site的步骤. 对于已经按blog建立的站点, 我们可以进行下面的改造.
</p>

<div class="highlight"><pre><span></span><span class="n">INDEX_PATH</span> <span class="o">=</span> <span class="s2">"posts"</span>
<span class="n">PAGES</span> <span class="o">=</span> <span class="p">(</span>
    <span class="p">(</span><span class="s2">"stories/*.rst"</span><span class="p">,</span> <span class="s2">""</span><span class="p">,</span> <span class="s2">"story.tmpl"</span><span class="p">),</span> <span class="c1"># Must use "" to put generated pages directly under the root directory</span>
    <span class="p">(</span><span class="s2">"stories/*.md"</span><span class="p">,</span> <span class="s2">""</span><span class="p">,</span> <span class="s2">"story.tmpl"</span><span class="p">),</span>
    <span class="p">(</span><span class="s2">"stories/*.org"</span><span class="p">,</span> <span class="s2">""</span><span class="p">,</span> <span class="s2">"story.tmpl"</span><span class="p">),</span>
    <span class="p">(</span><span class="s2">"stories/*.txt"</span><span class="p">,</span> <span class="s2">""</span><span class="p">,</span> <span class="s2">"story.tmpl"</span><span class="p">),</span>
    <span class="p">(</span><span class="s2">"stories/*.html"</span><span class="p">,</span> <span class="s2">""</span><span class="p">,</span> <span class="s2">"story.tmpl"</span><span class="p">),</span>
    <span class="p">(</span><span class="s2">"stories/*.ipynb"</span><span class="p">,</span> <span class="s2">""</span><span class="p">,</span> <span class="s2">"story.tmpl"</span><span class="p">),</span>
<span class="p">)</span>
</pre></div>

<p>
然后我们可以使用 nikola new<sub>page</sub> -t Home 创建一个名为 “Home” 的页面. (slug 改为index). 现在我们还需要根据 output/ 下目录的变化重新调整导航栏, 并且把posts放到 “Blog” 导航栏里.
</p>

<div class="highlight"><pre><span></span><span class="n">NAVIGATION_LINKS</span> <span class="o">=</span> <span class="p">{</span>
    <span class="n">DEFAULT_LANG</span><span class="p">:</span> <span class="p">(</span>
	<span class="p">(</span><span class="s2">"/posts/"</span><span class="p">,</span> <span class="s2">"Blog"</span><span class="p">),</span>
		    <span class="p">(</span><span class="s2">"/categories/"</span><span class="p">,</span> <span class="s2">"Tags"</span><span class="p">),</span>
	<span class="p">(</span><span class="s2">"/archive.html"</span><span class="p">,</span> <span class="s2">"Archive"</span><span class="p">),</span>
	<span class="p">(</span><span class="s2">"/about/index.html"</span><span class="p">,</span> <span class="s2">"About"</span><span class="p">),</span>
		    <span class="p">(</span><span class="s2">"/rss.xml"</span><span class="p">,</span> <span class="s2">"RSS feed"</span><span class="p">),</span>
    <span class="p">),</span>
<span class="p">}</span>
</pre></div>

<p>
这时可以编辑你自己的 home.rst 了. 也可以直接用我们之前做的 about.rst 链接过来做主页: .. include:: stories/about.rst. 如果你正在使用基于 bootstrap3 的主题, 因为它基于 Bootstrap, 因此任何 Bootstrap 支持的格式都可以用 .rst 来表达. 可以参考 这里 <a href="https://getnikola.com/creating-a-site-not-a-blog-with-nikola.html">https://getnikola.com/creating-a-site-not-a-blog-with-nikola.html</a> 的一个例子来写主页. 更多语法上的参考还可以看 这里 <a href="https://github.com/rougier/bootstrap-rst">https://github.com/rougier/bootstrap-rst</a> .
</p>
</div>
</div>
</div>
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8">
<span class="section-number-2">8</span> 其它输入格式</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1">
<span class="section-number-3">8.1</span> reST中插入多种格式</h3>
<div class="outline-text-3" id="text-8-1">
</div>
<div id="outline-container-sec-8-1-1" class="outline-4">
<h4 id="sec-8-1-1">
<span class="section-number-4">8.1.1</span> media</h4>
<div class="outline-text-4" id="text-8-1-1">
<pre class="example">
.. media:: http://vimeo.com/72425090
.. media:: http://www.youtube.com/watch?v=wyRpAat5oz0
</pre>
</div>
</div>
<div id="outline-container-sec-8-1-2" class="outline-4">
<h4 id="sec-8-1-2">
<span class="section-number-4">8.1.2</span> YouTube, Vimeo, Soundcloud</h4>
<div class="outline-text-4" id="text-8-1-2">
<pre class="example">
.. youtube:: 8N_tupPBtWQ

.. vimeo:: 20241459

.. vimeo:: 20241459
   :height: 240
   :width: 320

[soundcloud url="http://api.soundcloud.com/tracks/78131362"

.. soundcloud:: 78131362
</pre>
</div>
</div>
<div id="outline-container-sec-8-1-3" class="outline-4">
<h4 id="sec-8-1-3">
<span class="section-number-4">8.1.3</span> Code</h4>
<div class="outline-text-4" id="text-8-1-3">
<pre class="example">
.. code-block:: python
   :number-lines:

   print("Our virtues and our failings are inseparable")
</pre>
</div>
</div>
<div id="outline-container-sec-8-1-4" class="outline-4">
<h4 id="sec-8-1-4">
<span class="section-number-4">8.1.4</span> Listing</h4>
<div class="outline-text-4" id="text-8-1-4">
<p>
将 foo.py 文件放在 LISTINGS<sub>FOLDERS</sub> 指定的目录下.
</p>

<pre class="example">
.. listing:: foo.py python
</pre>
</div>
</div>
<div id="outline-container-sec-8-1-5" class="outline-4">
<h4 id="sec-8-1-5">
<span class="section-number-4">8.1.5</span> Gist</h4>
<div class="outline-text-4" id="text-8-1-5">
<div class="highlight"><pre><span></span>.. gist:: 2395294
</pre></div>
</div>
</div>
<div id="outline-container-sec-8-1-6" class="outline-4">
<h4 id="sec-8-1-6">
<span class="section-number-4">8.1.6</span> Thumbnails</h4>
<div class="outline-text-4" id="text-8-1-6">
<p>
To include an image placed in the images folder (or other folders defined in IMAGEFOLDERS), use the thumbnail directive, like this:
</p>
<pre class="example">
.. thumbnail:: ../tesla.jpg

   Nikola Tesla, the man that invented the 20th century.
</pre>
</div>
</div>
<div id="outline-container-sec-8-1-7" class="outline-4">
<h4 id="sec-8-1-7">
<span class="section-number-4">8.1.7</span> Slideshows</h4>
<div class="outline-text-4" id="text-8-1-7">
<pre class="example">
.. slides::

   /galleries/demo/tesla_conducts_lg.jpg
   /galleries/demo/tesla_lightning2_lg.jpg
   /galleries/demo/tesla4_lg.jpg
   /galleries/demo/tesla_lightning1_lg.jpg
   /galleries/demo/tesla_tower1_lg.jpg
</pre>
</div>
</div>
<div id="outline-container-sec-8-1-8" class="outline-4">
<h4 id="sec-8-1-8">
<span class="section-number-4">8.1.8</span> Chart</h4>
<div class="outline-text-4" id="text-8-1-8">
<p>
可以参考 这里 <a href="http://www.pygal.org/en/latest/">http://www.pygal.org/en/latest/</a>
</p>

<pre class="example">
.. chart:: Bar
   :title: 'Browser usage evolution (in %)'
   :x_labels: ["2002", "2003", "2004", "2005", "2006", "2007"]
   'Firefox', [None, None, 0, 16.6, 25, 31]
   'Chrome',  [None, None, None, None, None, None]
   'IE',      [85.8, 84.6, 84.7, 74.5, 66, 58.6]
   'Others',  [14.2, 15.4, 15.3, 8.9, 9, 10.4]
</pre>
</div>
</div>
<div id="outline-container-sec-8-1-9" class="outline-4">
<h4 id="sec-8-1-9">
<span class="section-number-4">8.1.9</span> Doc</h4>
<div class="outline-text-4" id="text-8-1-9">
<p>
用于跳转到其它页面.
</p>

<pre class="example">
Take a look at :doc:`my other post &lt;creating-a-theme&gt;` about theme creating.
Take a look at :doc:`creating-a-theme` to know how to do it.
</pre>
</div>
</div>
</div>
